---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeVertex
source: html/4bf4e5e0-d0cc-d21e-3c82-a0b1c3e35b13.htm
---
# RebarShapeVertex Methods

Retrieve the list of constraints associated with this vertex.